<?php
namespace backend\libraries;


class FreightTemplateLib
{
    /**
     * 获取全国省信息（和前端约定好的）key值为省会的区号.
     * @return array
     */
    public static function getProvinceInfo()
    {
        $provinces = [
            'p010'=>'北京市',
            'p022'=>'天津市',
            'p021'=>'上海市',
            'p023'=>'重庆市',
            'p0311'=>'河北省',
            'p0351'=>'山西省',
            'p024'=>'辽宁省',
            'p0431'=>'吉林省',
            'p0451'=>'黑龙江省',
            'p025'=>'江苏省',
            'p0571'=>'浙江省',
            'p0551'=>'安徽省',
            'p0591'=>'福建省',
            'p0791'=>'江西省',
            'p0531'=>'山东省',
            'p0371'=>'河南省',
            'p027'=>'湖北省',
            'p0731'=>'湖南省',
            'p020'=>'广东省',
            'p0898'=>'海南省',
            'p028'=>'四川省',
            'p0851'=>'贵州省',
            'p0871'=>'云南省',
            'p029'=>'陕西省',
            'p0931'=>'甘肃省',
            'p0971'=>'青海省',
            'p0891'=>'西藏自治区',
            'p0471'=>'内蒙古自治区',
            'p0771'=>'广西壮族自治区',
            'p0951'=>'宁夏回族自治区',
            'p0991'=>'新疆维吾尔自治区'
        ];
        return $provinces;
    }

}